InformationRegisters/омг_ЛицензированныеВидыДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_ЛицензированныеВидыДеятельности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_МедицинскиеЛицензии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бессрочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СостоянияМедицинскихЛицензий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодвидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ВидыЛицензируемойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ПриложенияКЛицензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/омг_ПриложенияКЛицензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>омг_ПриложенияКЛицензии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.омг_МедицинскиеЛицензии</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроизводственнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СостоянияМедицинскихЛицензий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подвиды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодвидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.омг_ВидыЛицензируемойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/омг_ЛицензированныеВидыДеятельности/Ext/ManagerModule.bsl
Процедура ОтразитьПриложение(ПриложениеОбъект) Экспорт

    Набор = РегистрыСведений.омг_ЛицензированныеВидыДеятельности.СоздатьНаборЗаписей();
    Набор.Отбор.Приложение.Установить(ПриложениеОбъект.Ссылка);

    Если НЕ ПриложениеОбъект.ПометкаУдаления Тогда

        Лицензия    = ПриложениеОбъект.Владелец;
        Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лицензия, "Организация");

        Для Каждого СтрокаТЧ Из ПриложениеОбъект.Подвиды Цикл

            Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПодвидДеятельности) Тогда
                Продолжить;
            КонецЕсли;

            Запись = Набор.Добавить();
            Запись.МедицинскийЦентр   = ПриложениеОбъект.МедицинскийЦентр;
            Запись.ПодвидДеятельности = СтрокаТЧ.ПодвидДеятельности;
            Запись.Приложение         = ПриложениеОбъект.Ссылка;
            Запись.Лицензия           = Лицензия;
            Запись.Организация        = Организация;
            Запись.Бессрочно          = ПриложениеОбъект.Бессрочное;
            Запись.ДатаОкончания      = ПриложениеОбъект.ДатаОкончания;
            Запись.Состояние          = ПриложениеОбъект.Состояние;

        КонецЦикла;

    КонецЕсли;

    Набор.Записать(Истина);

КонецПроцедуры

Процедура ПерезаполнитьПоЛицензии(Лицензия) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Приложения.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.омг_ПриложенияКЛицензии КАК Приложения
    |ГДЕ
    |   Приложения.Владелец = &Лицензия";
    Запрос.УстановитьПараметр("Лицензия", Лицензия);

    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        ОтразитьПриложение(Выборка.Ссылка.ПолучитьОбъект());
    КонецЦикла;

КонецПроцедуры
